[
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3+ months",
        "role": "Applications Support Engineer",
        "details": "1.HR round(online video recorded)-15 mins2.Technical Phone Interview(Math,C/C++,Programming Concepts,Control Systems)-1 hour3.On-site interview(Math,C/C++,Programming Concepts,Control Systems)-4 rounds 9 am - 2 pmProgramming Concepts1.Given a random array of numbers.How do you sort them?Select any sorting algorithm and write the pseudo code.(C)I implemented Merge Sort with merge subroutineI forgot base case ,I added later2.1/8th of a circle.(NS)I gave semi optimum solution.There was a better way without using trignometric functionsC++2.Given inheritence hierarchy -which of the following…  is valid?(C)    A   / \\  B C /Dvoid alpha(B *arg)A*Aptr =new A;B*Bptr=new B;(valid)C* Cptr=new C;D*Dptr=new D;(valid)3.What does the following line of code do?(C)char*c =\"Hello\"char d[6];while(*c++=*d++);MatlabWhat is primary function and subfunction?(C)What is difference between nested function and subfunction?(C)nested functions-can access variables declared inside main functions.What is private function?(C)inside private folderWhat is hf=gca;(DA)guireturns current axes handleWhat is event function call back?(DA)How to access data members of a structure?What are cell arrays?C1={}C2={}what is C1()what is C1{}What is this code doingmystruct =struct('field1',{1,2,3}...'field2',{4,5,6s});MATH1.Plot the derivative of the function(C)2.Find the partial fraction of given expression(C)3.Find the gradient of the given function.(C)Controls Systems1.Explain lead and lag compensators(C)2.Linearise the system(C)3.Find the Transfer function from the state space equation.(C)4.Given x1 and x2 dot ,find the Lyapunov equation.(NC)Hiring Manager Interview1.How do you handle several projects simultaneously?2.What are your strengths and weaknessness,according to your advisor?3.How did you handle a situation when you missed a deadline?4.How was your experience at Grad School?5.If you are the dean of your university ,what would you change?6.How did you approach a task which you had no knowledge before hand?HR InterviewWhy did you apply at MathWorks?If I gave you $2000 for training ,what training would you use it for?What is your plan after EDG?",
        "questions": [],
        "date": "Mar 13, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Applications Support Engineer",
        "details": "First round is Basic HR interview questions online one way interview process.Sencond round is technical quiz. Basic programming questions on c/c++ java java sc python matlabEasy for coumputer science people",
        "questions": [
            "GPA?Why matheworks?Visa status?  "
        ],
        "date": "Feb 8, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Applications Support Engineer",
        "details": "The process takes about 2 to 3 months. The first round was HR. I was asked about 1) Visa status 2) Explain what makes me a best fit for the job 3) How I manage to handle difficult situations.Second round was Hacker rank coding challenge: Includes skills in MATLAB, C++, python and Java.3) Third round was a technical phone interview:MATLAB: Explain the reason why a script runs slow and give…  necessary solutions to overcome the issue.MATH: Arithmetic progression and probability.c++: What is OOPS? advantages of OOPS? Explain inheritance briefly, algorithm for GCD of two numbers and to find its time complexity.Embedded systems and OS: what is priority inversion? Difference between threads and processes?",
        "questions": [
            "No unexpected questions. You find everything on glassdoor.  "
        ],
        "date": "Feb 9, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Applications Support Engineer",
        "details": "An hour long interview was set up with an engineer from Mathworks. Was asked to choose two languages for asking questions. Was drilled on Java and Python. Both basics and high level questions were asked. Then a Math round with questions on math principles and their applications. A screen was displayed onto which I had to write my answers.",
        "questions": [
            "Design questions  "
        ],
        "date": "Jan 28, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Applications Support Engineer",
        "details": "I was asked to choose a time slot for a phone interview. HR called at the scheduled time and asked me some basic questions. She also explained the position. The whole interview lasted just 10-15minutes At the end she asked me to complete a coding challenge through Hackerrank and time frame to complete it is 7 days.",
        "questions": [
            "1) Visa status 2)GPA 3) Describe one project in layman's terms 4) Any other offers that I have 5)Programming languages I am comfortable with  "
        ],
        "date": "Feb 11, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Engineering - Applications Support Engineer",
        "details": "Get an HireVue interview after submitting application 2 weeks. The video interview took about 15 minutes. Answer questions by video. The questions are pre-defined. You have two chances to answer each question. The answering video will be submitted automatically.",
        "questions": [
            "Why do you apply for this position?What do you do if you have multiple tasks in hands ?  "
        ],
        "date": "Jan 29, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Applications Support Engineer",
        "details": "The interviewer seems nice, and she asked some basic questions, such as GPA, visa status, programming languages and team work experience. But no responses after the phone interview. I checked online application system, and it shows not an ideal match.",
        "questions": [
            "GPA, visa status, programming languages and team work experience  "
        ],
        "date": "Jan 27, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "-",
        "length": "-",
        "role": "Applications Support Engineer",
        "details": "I applied online in new grad section for Application Support Engineer. Then I received an email from Mathworks to self-scheduled first round phone interview. Basically, it was about behavior questions and academic backgrounds like GPA and graduation date. Then a Hackerrank coding test is sent. I need to complete them in 7 days.",
        "questions": [
            "GPA, graduation date, visa status  ",
            "Briefly describe one of your projects in non-technical terms.  ",
            "Do you know control systems or image processing or embedded system?  ",
            "How did you manage a team? Your leadership experience.  "
        ],
        "date": "Jan 20, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "2 weeks",
        "role": "Software Developer",
        "details": "The interview is all-day starting at 9 AM and ends around 3:30 - 4 PM with an hours break for lunch (they are nice and buy you the lunch!).Candidates have a 45 min presentation to talk about their past projects from their education and work experiences. This is very interactive you may be asked to cut-to-chase depending on the panel's judgement.Following the presentation is a series of 4 technical interviews…  with your future team members. Each vary in complexity and size.Lunch interview can be interesting as always but don't drop your guard yet, until you go home maybe.",
        "questions": [
            "How do you find the square root of an integer N, in log2[N] steps ?  ",
            "How would you detect cycles in a directed acyclic graph ?  "
        ],
        "date": "Jan 21, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Associate Software Engineer",
        "details": "I had a 1 hour online interview with really basic programming questions.Next, I was quickly invited for an onsite interview. They took care of me really well: food, flight, hotel.It was a half-day interview, starting with a 1-hour of whiteboard programming questions. I learned the history of the company, and got to see the campus. Lunch was served.I had a 30-minute interview with HR and a 30-minute interview with the…  head of the Associate SEs.",
        "questions": [
            "Q: Define a class structure for a vending machine.I was also asked questions testing my regex skills.  "
        ],
        "date": "Jan 17, 2017"
    }
]